In [1]:
# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
dataset = pd.read_csv('PycharmProjects/HousePredict/house.csv')

In [3]:
dataset

    area  bedrooms  bathrooms  stories  parking     price
0   7420         4          2        3        2  13300000
1   8960         4          4        4        3  12250000
2   9960         3          2        2        2  12250000
3   7500         4          2        2        3  12215000
4   7420         4          1        2        2  11410000
5   7500         3          3        1        2  10850000
6   8580         4          3        4        2  10150000
7  16200         5          3        2        0  10150000
8   8100         4          1        2        2   9870000

In [4]:
X = dataset.iloc[:, :5]

In [5]:
X

    area  bedrooms  bathrooms  stories  parking
0   7420         4          2        3        2
1   8960         4          4        4        3
2   9960         3          2        2        2
3   7500         4          2        2        3
4   7420         4          1        2        2
5   7500         3          3        1        2
6   8580         4          3        4        2
7  16200         5          3        2        0
8   8100         4          1        2        2

In [6]:
y = dataset.iloc[:, -1]

In [7]:
y

0    13300000
1    12250000
2    12250000
3    12215000
4    11410000
5    10850000
6    10150000
7    10150000
8     9870000
Name: price, dtype: int64

In [8]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [9]:
regressor.fit(X, y)

LinearRegression()

In [10]:
regressor.predict([[8100,4,1,2,2]])

array([11348149.78583776])

In [11]:
## Saving model to disk
import pickle
pickle.dump(regressor, open('house.pkl','wb'))

In [13]:
# Loading model to compare the results
model = pickle.load(open('house.pkl','rb'))
print(model.predict([[8100,4,1,2,2]]))

[11348149.78583776]